Revit 2025 API
AnalysisDisplayStyleVectorPosition Enumeration
 Defines vector position for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AnalysisDisplayStyleVectorPosition
Public Enumeration AnalysisDisplayStyleVectorPosition
public enum class AnalysisDisplayStyleVectorPosition
type AnalysisDisplayStyleVectorPosition
Members
Member name | Value | Description
ToDataPoint | 0
FromDataPoint | 1
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace